const quiz = {
  data: [
    {
      question: "Какой герой мультфильма живет в ананасе под водой?",
      option: [
        "A: Камбала",
        "B: Немо",
        "C: Рик и Морти",
        "D: Губка Боб Квадратные Штаны",
      ],
      answer: 3,
    },
    {
      question: "Что является национальным животным Шотландии?",
      option: ["A: Лошадь", "B: Единорог", "C: Волк", "D: Корова"],
      answer: 1,
    },
    {
      question: " Какая страна производит больше всего кофе в мире?",
      option: ["A: Колумбия", "B: Индонезия", "C: Бразилия", "D: Вьетнам"],
      answer: 2,
    },
    {
      question: " Какой национальный вид спорта Канады?",
      option: ["A: Боулинг", "B: Баскетбол", "C: Лакросс", "D: Футбол"],
      answer: 3,
    },
    {
      question: "Какие функции выполняет JS?",
      option: [
        "A: Создает стилевое оформление сайта",
        "B: Отвечает за работу с базами данных",
        "C: Отвечает за функции на стороне клиента",
        "D: Выполняет работу с сервером",
      ],
      answer: 2,
    },
    {
      question: "Какие функции выполняет JS?",
      option: [
        "A: Создает стилевое оформление сайта",
        "B: Отвечает за работу с базами данных",
        "C: Отвечает за функции на стороне клиента",
        "D: Выполняет работу с сервером",
      ],
      answer: 2,
    },
    {
      question: "Какие функции выполняет JS?",
      option: [
        "A: Создает стилевое оформление сайта",
        "B: Отвечает за работу с базами данных",
        "C: Отвечает за функции на стороне клиента",
        "D: Выполняет работу с сервером",
      ],
      answer: 2,
    },
    {
      question: "Какие функции выполняет JS?",
      option: [
        "A: Создает стилевое оформление сайта",
        "B: Отвечает за работу с базами данных",
        "C: Отвечает за функции на стороне клиента",
        "D: Выполняет работу с сервером",
      ],
      answer: 2,
    },
    {
      question: "Какие функции выполняет JS?",
      option: [
        "A: Создает стилевое оформление сайта",
        "B: Отвечает за работу с базами данных",
        "C: Отвечает за функции на стороне клиента",
        "D: Выполняет работу с сервером",
      ],
      answer: 2,
    },
    {
      question: "Какие функции выполняет JS?",
      option: [
        "A: Создает стилевое оформление сайта",
        "B: Отвечает за работу с базами данных",
        "C: Отвечает за функции на стороне клиента",
        "D: Выполняет работу с сервером",
      ],
      answer: 2,
    },
    {
      question: "Какие функции выполняет JS?",
      option: [
        "A: Создает стилевое оформление сайта",
        "B: Отвечает за работу с базами данных",
        "C: Отвечает за функции на стороне клиента",
        "D: Выполняет работу с сервером",
      ],
      answer: 2,
    },
    {
      question: "Какие функции выполняет JS?",
      option: [
        "A: Создает стилевое оформление сайта",
        "B: Отвечает за работу с базами данных",
        "C: Отвечает за функции на стороне клиента",
        "D: Выполняет работу с сервером",
      ],
      answer: 2,
    },
    {
      question: "Какие функции выполняет JS?",
      option: [
        "A: Создает стилевое оформление сайта",
        "B: Отвечает за работу с базами данных",
        "C: Отвечает за функции на стороне клиента",
        "D: Выполняет работу с сервером",
      ],
      answer: 2,
    },
    {
      question: "Какие функции выполняет JS?",
      option: [
        "A: Создает стилевое оформление сайта",
        "B: Отвечает за работу с базами данных",
        "C: Отвечает за функции на стороне клиента",
        "D: Выполняет работу с сервером",
      ],
      answer: 2,
    },
    {
      question: "Какие функции выполняет JS?",
      option: [
        "A: Создает стилевое оформление сайта",
        "B: Отвечает за работу с базами данных",
        "C: Отвечает за функции на стороне клиента",
        "D: Выполняет работу с сервером",
      ],
      answer: 2,
    },
  ],

  // (A2) HTML ELEMENTS
  hWrap: null, // HTML quiz container
  hQn: null, // HTML question wrapper
  hAns: null, // HTML answers wrapper

  now: 0, // current question
  score: 0, // current score
};

//SOUNDS:

// var audio = new Audio();
// audio.preload = "auto";
// audio.src = "../src/audio/correct_Answer.mp3";
