const quiz = {
  data: [
    {
      question: "Какие функции выполняет JS?",
      option: [
        "Создает стилевое оформление сайта",
        "Отвечает за работу с базами данных",
        "Отвечает за функции на стороне клиента",
        "Выполняет работу с сервером",
      ],
      answer: 2, // arrays start with 0, so answer is 70 meters
    },
    {
      question: "Какие функции выполняет JS?",
      option: [
        "Создает стилевое оформление сайта",
        "Отвечает за работу с базами данных",
        "Отвечает за функции на стороне клиента",
        "Выполняет работу с сервером",
      ],
      answer: 2, // arrays start with 0, so answer is 70 meters
    },
    {
      question: "Какие функции выполняет JS?",
      option: [
        "Создает стилевое оформление сайта",
        "Отвечает за работу с базами данных",
        "Отвечает за функции на стороне клиента",
        "Выполняет работу с сервером",
      ],
      answer: 2, // arrays start with 0, so answer is 70 meters
    },
    {
      question: "Какие функции выполняет JS?",
      option: [
        "Создает стилевое оформление сайта",
        "Отвечает за работу с базами данных",
        "Отвечает за функции на стороне клиента",
        "Выполняет работу с сервером",
      ],
      answer: 2, // arrays start with 0, so answer is 70 meters
    },
    {
      question: "Какие функции выполняет JS?",
      option: [
        "Создает стилевое оформление сайта",
        "Отвечает за работу с базами данных",
        "Отвечает за функции на стороне клиента",
        "Выполняет работу с сервером",
      ],
      answer: 2, // arrays start with 0, so answer is 70 meters
    },
    {
      question: "Какие функции выполняет JS?",
      option: [
        "Создает стилевое оформление сайта",
        "Отвечает за работу с базами данных",
        "Отвечает за функции на стороне клиента",
        "Выполняет работу с сервером",
      ],
      answer: 2, // arrays start with 0, so answer is 70 meters
    },
    {
      question: "Какие функции выполняет JS?",
      option: [
        "Создает стилевое оформление сайта",
        "Отвечает за работу с базами данных",
        "Отвечает за функции на стороне клиента",
        "Выполняет работу с сервером",
      ],
      answer: 2, // arrays start with 0, so answer is 70 meters
    },
    {
      question: "Какие функции выполняет JS?",
      option: [
        "Создает стилевое оформление сайта",
        "Отвечает за работу с базами данных",
        "Отвечает за функции на стороне клиента",
        "Выполняет работу с сервером",
      ],
      answer: 2, // arrays start with 0, so answer is 70 meters
    },
    {
      question: "Какие функции выполняет JS?",
      option: [
        "Создает стилевое оформление сайта",
        "Отвечает за работу с базами данных",
        "Отвечает за функции на стороне клиента",
        "Выполняет работу с сервером",
      ],
      answer: 2, // arrays start with 0, so answer is 70 meters
    },
    {
      question: "Какие функции выполняет JS?",
      option: [
        "Создает стилевое оформление сайта",
        "Отвечает за работу с базами данных",
        "Отвечает за функции на стороне клиента",
        "Выполняет работу с сервером",
      ],
      answer: 2, // arrays start with 0, so answer is 70 meters
    },
    {
      question: "Какие функции выполняет JS?",
      option: [
        "Создает стилевое оформление сайта",
        "Отвечает за работу с базами данных",
        "Отвечает за функции на стороне клиента",
        "Выполняет работу с сервером",
      ],
      answer: 2, // arrays start with 0, so answer is 70 meters
    },
    {
      question: "Какие функции выполняет JS?",
      option: [
        "Создает стилевое оформление сайта",
        "Отвечает за работу с базами данных",
        "Отвечает за функции на стороне клиента",
        "Выполняет работу с сервером",
      ],
      answer: 2, // arrays start with 0, so answer is 70 meters
    },
    {
      question: "Какие функции выполняет JS?",
      option: [
        "Создает стилевое оформление сайта",
        "Отвечает за работу с базами данных",
        "Отвечает за функции на стороне клиента",
        "Выполняет работу с сервером",
      ],
      answer: 2, // arrays start with 0, so answer is 70 meters
    },
    {
      question: "Какие функции выполняет JS?",
      option: [
        "Создает стилевое оформление сайта",
        "Отвечает за работу с базами данных",
        "Отвечает за функции на стороне клиента",
        "Выполняет работу с сервером",
      ],
      answer: 2, // arrays start with 0, so answer is 70 meters
    },
    {
      question: "Какие функции выполняет JS?",
      option: [
        "Создает стилевое оформление сайта",
        "Отвечает за работу с базами данных",
        "Отвечает за функции на стороне клиента",
        "Выполняет работу с сервером",
      ],
      answer: 2, // arrays start with 0, so answer is 70 meters
    },
  ],

  // (A2) HTML ELEMENTS
  hWrap: null, // HTML quiz container
  hQn: null, // HTML question wrapper
  hAns: null, // HTML answers wrapper

  now: 0, // current question
  score: 0, // current score
};

//SOUNDS:

// var audio = new Audio();
// audio.preload = "auto";
// audio.src = "../src/audio/correct_Answer.mp3";
